{"_type": "release", "_id": "2747360", "title": "Februar 2020", "date": "2020-02-11", "changes": [{"_type": "change", "_id": "2747355", "changeType": "new", "title": "Themen-Sammlungen", "description": "Themen können nun in Sammlungen zusammengefasst werden, z.B. alle für die nächste Eigentümerversammlung relevanten Themen."}, {"_type": "change", "_id": "2747356", "changeType": "new", "title": "Ansprechpartner", "description": "Alle wichtigen Ansprechpartner (Hausmeister, Heizung, Sanitär, etc.) können nun erfasst werden und stehen allen Nutzern zur Verfügung. Die wichtigsten Ansprechpartner können direkt auf der Startseite eingeblendet werden."}, {"_type": "change", "_id": "2747357", "changeType": "improved", "title": "Texterkennung für PDFs", "description": "Aus eingescannten PDF-Dateien wird nun mittels Texterkennung der Text extrahiert und durchsuchbar gemacht"}, {"_type": "change", "_id": "2747358", "changeType": "improved", "title": "Verbesserte Suchfunktion", "description": "Die Suchfunktion wurde verbessert und zeigt nun bereits Suchergebnisse, wenn der Suchbegriff erst teilweise eingegeben ist. Außerdem funktioniert sie nun auch auf mobilen Geräten."}, {"_type": "change", "_id": "2747359", "changeType": "improved", "title": "Meta-Informationen zu Themen", "description": "Veränderungen beim Status, der Zuständigkeit oder der Sichtbarkeit von Themen werden jetzt zwischen den Diskussionsbeiträgen an der chronologisch richtigen Stelle eingeblendet."}]}
{"_type": "release", "_id": "2747158", "title": "Januar 2020", "date": "2020-01-22", "changes": [{"_type": "change", "_id": "2747152", "changeType": "new", "title": "Export der Beschlusssammlung", "description": "Die Beschlusssammlung kann nun als PDF-Datei exportiert werden. Dies ermöglicht der Verwaltung nun die gesamte Pflege der Beschlüsssammlung direkt in WEG+."}, {"_type": "change", "_id": "2747153", "changeType": "new", "title": "Stimmprinzip", "description": "In den Einstellungen kann nun das Stimmprinzip der WEG (Wert, Kopf, Objekt) ausgewählt werden. "}, {"_type": "change", "_id": "2747154", "changeType": "new", "title": "Hinweis bei gelöschten Kommentaren", "description": "Gelöschte Kommentare verschwinden nicht mehr spurlos sondern werden durch einen entsprechenden Hinweis ersetzt."}, {"_type": "change", "_id": "2747155", "changeType": "new", "title": "Themen Wohneinheiten zuordnen", "description": "Themen können nun betroffene Wohneinheiten zugeordnet werden. Dies ermöglicht die Einschränkung der Themenliste auf alle Themen zu einer Wohneinheit. "}, {"_type": "change", "_id": "2747156", "changeType": "new", "title": "Hilfe & Support", "description": "Links unten finden Sie einen neuen Link \"Hilfe & Support\". Dort können Sie mit uns in Kontakt treten, Probleme melden oder Änderungsvorschläge machen. Perspektivisch werden Sie hier auch Bedienungshinweise und Anleitungen finden."}, {"_type": "change", "_id": "2747157", "changeType": "improved", "title": "Benachrichtigungen", "description": "Das Benachrichtigungssystem wurde komplett überarbeitet. Nutzer_innen erhalten nun unmittelbar eine Benachrichtigung per E-Mail, wenn ein neues Thema erstellt, eine Kommentar zu einem abonnierten Thema abgegeben wird oder sie/er explizit erwähnt wird."}]}
{"_type": "release", "_id": "2746732", "title": "November 2019", "date": "2019-11-20", "changes": [{"_type": "change", "_id": "2746729", "changeType": "new", "title": "PDFs durchsuchbar", "description": "Aus hochgeladenen Dokumenten wird automatisch der Text extrahiert und mittels der bekannten Suchfunktion durchsuchbar gemacht."}, {"_type": "change", "_id": "2746730", "changeType": "improved", "title": "Dokumentkategorie in Übersichtsliste", "description": "In der Dokumenteübersicht wird nun auch die Kategorie angezeigt."}, {"_type": "change", "_id": "2746731", "changeType": "improved", "title": "Warnung vor Datenverlust", "description": "Es wird ein Warnhinweis über bevorstehenden Datenverlust angezeigt, wenn vergessen wird, den \"Speichern\"-Button anzuklicken."}]}
{"_type": "release", "_id": "2746608", "title": "September 2019", "date": "2019-09-29", "changes": [{"_type": "change", "_id": "2746607", "changeType": "new", "title": "Bulk Actions", "description": "Wohneinheiten können jetzt im Block angelegt und auch gelöscht werden, d.h. Sie geben die Anzahl der Wohneinheiten, das Gebäude sowie das Nummerierungsschema an, und die Wohneinheiten werden mit einem Klick angelegt."}]}
{"_type": "release", "_id": "2746485", "title": "August 2019", "date": "2019-08-15", "changes": [{"_type": "change", "_id": "2746482", "changeType": "new", "title": "Suchfunktion", "description": "Es gibt nun eine Suchfunktion, die Ergebnisse aus allen Bereichen (Themen, Dokumente, Beschlüsse, Wohneinheiten) in strukturierter Form angezeigt."}, {"_type": "change", "_id": "2746483", "changeType": "new", "title": "Angepinnte Themen", "description": "Themen können nun angepinnt werden, das heißt sie erscheinen immer an oberster Stelle in der Themenliste. Dies bietet sich an, um z.B. allgemeine Hinweise zur Benutzung des Systems oder öfters wiederkehrende Themen direkt sichtbar und schnell zugänglich zu halten."}, {"_type": "change", "_id": "2746484", "changeType": "new", "title": "Priorität", "description": "Themen können jetzt eine Priorität haben: normal, hoch oder niedrig. Themen mit hoher Priorität werden in der Liste oben, solche mit niedriger weiter unten angezeigt."}]}
{"_type": "release", "_id": "2746145", "title": "Juli 2019", "date": "2019-07-22", "changes": [{"_type": "change", "_id": "2746338", "changeType": "new", "title": "Benutzer einladen", "description": "Neue Benutzer können einer WEG hinzugefügt und automatisch eingeladen werden. Es wird dann eine Email mit einem Link verschickt, und wenn dieser angeklickt wird, kann der Benutzer sein Passwort festlegen und ggf. ein Profilbild hochladen."}, {"_type": "change", "_id": "2746339", "changeType": "new", "title": "Ankündigungen", "description": "Verwalter können nun Ankündigungen (z.B. anstehende Termine, Bauarbeiten, etc.) erstellen, die allen Benutzern prominent auf der Startseite eingeblendet werden sowie in den Email-Zusammenfassungen erscheinen."}, {"_type": "change", "_id": "2746340", "changeType": "new", "title": "Profilseite", "description": "Jeder Benutzer hat nun seine eigene Profilseite mit Name, Funktion, Wohneinheiten und Aktivitäten"}, {"_type": "change", "_id": "2746341", "changeType": "new", "title": "Profilbild", "description": "Benutzer können nun ein Profilbild hochladen, das dann anstelle der Initialen angezeigt wird."}, {"_type": "change", "_id": "2746342", "changeType": "improved", "title": "Zugriffsrechte für Themen", "description": "Bei jedem Thema kann nun angegeben werden, welchem Benutzerkreis dieses zugänglich gemacht werden soll. Als Optionen stehen zur Verfügung: \"Ich selber\", \"Eigentümer\", \"Beirat\", \"Verwaltung\", sowie ggf. alle weiteren WEG-spezifischen Gruppen."}]}
